In [1]:
from shapely.geometry import Point
import pandas as pd
import geopandas as gpd
import matplotlib.pyplot as plt
import folium
from folium.plugins import MarkerCluster
from folium.plugins import FastMarkerCluster
from sqlalchemy import create_engine, text
import seaborn as sns
import psycopg2
from psycopg2 import sql

In [2]:
database_name = 'scooters'

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [3]:
engine = create_engine(connection_string)

In [5]:
query = '''
SELECT *
FROM scooters
LIMIT 100;
'''


with engine.connect() as connection:
    result = connection.execute(text(query))

- Are there any null values in any columns in either table?

- What date range is represented in each of the date columns? Investigate any values that seem odd

In [6]:
query = '''
SELECT COUNT(*)
FROM scooters
'''

pd.read_sql(query, con = engine)

      count
0  73414043

- Is time represented with am/pm or using 24 hour values in each of the columns that include time?

In [7]:
query = '''
SELECT *
FROM scooters
LIMIT 1'''

pd.read_sql(query, con = engine)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird

- What values are there in the sumdgroup column? Are there any that are not of interest for this project?

In [8]:
query = '''
SELECT DISTINCT sumdgroup
FROM scooters'''

pd.read_sql(query, con = engine)

  sumdgroup
0   bicycle
1   scooter
2   Scooter

- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
--Max Latitude is too large. Minimum longetude is only correct value.

In [17]:
query = '''
SELECT
    MIN(latitude) AS min_lat,
    MAX(latitude) AS max_lat,
    MIN(longitude) AS min_lon,
    MAX(longitude) AS max_Lon
FROM scooters
'''


scoots = pd.read_sql(query, con = engine)

scoots

   min_lat       max_lat    min_lon  max_lon
0      0.0  3.609874e+06 -97.443879      0.0

-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

In [ ]:
trips.tripduration.min()

In [ ]:
trips.tripduration.max()

In [ ]:
trips.tripdistance.max()

- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

In [ ]:
query = '''
SELECT DISTINCT companyname
FROM scooters'''

pd.read_sql(query, con = engine)

In [ ]:
trips.companyname.unique()

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [ ]:
query = '''
SELECT companyname, MONTH(pubdatetime), COUNT(DISTINCT sumdid)
FROM scooters
GROUP BY companyname, MONTH(pubdatetime)'''

pd.read_sql(query, con = engine)

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:

* Removal of staff servicing and test trips

* Removal of trips below one minute

* Trip lengths are capped at 24 hours

In [ ]:
query = '''
SELECT
    companyname,
    EXTRACT( 'MONTH' FROM pumdatetime) AS Month,
    COUNT(DISTICT sumdid) 
FROM scooters
WHERE sumdgroup ilike 'scooter'
GROUP BY companyname, EXTRACT('MONTH' FROM pubdatetime);
'''

with engine.connect() as connection:
    scoots = pd.read_sql(text(query), con = connection)

Are the scooter companies in compliance with the second and third part of this rule?

In [ ]:
trips.sort_values('tripduration',ascending=False)

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

4. What is the highest count of scooters being used at the same time? When did it occur? Does this vary by zip code or other geographic region?

4. SUMDs can provide alternative transportation and provide "last mile" access to public transit. How often are trips starting near public transit hubs? You can download a dataset of bus stop locations from https://data.nashville.gov/Transportation/Regional-Transportation-Authority-Bus-Stops/p886-fnbd.